app/controllers/api/diary_controller.rb

SELECT "diaries".* FROM "diaries" WHERE "diaries"."diary_date" = ? LIMIT ?  [["diary_date", "2024-03-24"], ["LIMIT", 1]]
SELECT "diaries".* FROM "diaries" WHERE "diaries"."diary_date" = ?  [["diary_date", "2024-03-24"]]
---
  def get_diary_by_date
    @data = Diary.find_by(diary_date: params[:date])

    if @data.present?

SELECT "diaries".* FROM "diaries" WHERE "diaries"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "diaries" WHERE "diaries"."id" = ?  [["id", 4]]
---
  def delete_diary_by_id
    @res = Diary.find_by(id: params[:id])

    if @res
      @res.destroy