app/views/calendar/index.html.erb

<script type="text/javascript">
    document.addEventListener('DOMContentLoaded', function() {
        var calendarEl = document.getElementById('calendar')
        var calendar = new FullCalendar.Calendar(calendarEl, {
            locale: sessionStorage.getItem('locale'),
            initialView: 'dayGridMonth',
            headerToolbar: {
                left: 'title',
                right: 'prev,next today',
                center: null,
            },
            selectable: true,
            navLinks: true,
            eventLimit: true,
            dayMaxEvents: 4,
            events: [
                <% @diary.each do |dt| %>
                    {
                        groupId: '<%= dt.id %>',
                        title: '<%= dt.diary_title.titleize %>',
                        start: '<%= dt.diary_date %>',
                        end: '<%= dt.diary_date %>'
                    },
                <% end %>
            ],
            eventClick:  function(info, jsEvent, view) {
---
SELECT "diaries"."id", "diaries"."diary_title", "diaries"."diary_date" FROM "diaries"