app/controllers/add_diary_controller.rb

  def create_diary
    # Attribute
    @diary_date = params[:diary_date]
    @diary_title = convert_title_format(params[:diary_title])

    @found = false
    @check = Diary.where(diary_date: @diary_date)

    # Check availableness
    if @check.length > 0
      @found = true
    end

    # Create
    if @found == false
      @data = Diary.create(
        diary_title: @diary_title,
        diary_desc: params[:diary_desc],
        diary_date: params[:diary_date],
        diary_mood: params[:diary_mood],
        diary_tired: params[:diary_tired],
        created_by: '1', #for now
      )
---
SELECT "diaries".* FROM "diaries" WHERE "diaries"."diary_date" = ?  [["diary_date", "2024-03-24"]]
INSERT INTO "diaries" ("diary_title", "diary_desc", "diary_date", "diary_mood", "diary_tired", "created_by", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)