app/controllers/calendar_controller.rb

  def index
    @diary = Diary.select(:id, :diary_title, :diary_date)
---
SELECT "diaries"."id", "diaries"."diary_title", "diaries"."diary_date" FROM "diaries"